---
type: Hardwood
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 10
tags: [revit-api, class]
---

# Hardwood

`Autodesk.Revit.DB.Visual.Hardwood` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CommonTintColor | 2018.1 | `public static string CommonTintColor { get ; }` |
| Property | CommonTintToggle | 2018.1 | `public static string CommonTintToggle { get ; }` |
| Property | HardwoodApplication | 2018.1 | `public static string HardwoodApplication { get ; }` |
| Property | HardwoodColor | 2018.1 | `public static string HardwoodColor { get ; }` |
| Property | HardwoodFinish | 2018.1 | `public static string HardwoodFinish { get ; }` |
| Property | HardwoodImperfections | 2018.1 | `public static string HardwoodImperfections { get ; }` |
| Property | HardwoodImperfectionsAmount | 2018.1 | `public static string HardwoodImperfectionsAmount { get ; }` |
| Property | HardwoodImperfectionsShader | 2018.1 | `public static string HardwoodImperfectionsShader { get ; }` |
| Property | HardwoodTintColor | 2018.1 | `public static string HardwoodTintColor { get ; }` |
| Property | HardwoodTintEnabled | 2018.1 | `public static string HardwoodTintEnabled { get ; }` |